<template>
    <div>
        <div class="background-with-image"></div>
        <div v-if="user && !user.isBlocked || !user" class="blur-container">
            <h1 class="mb-20">Неймовірні тварини</h1>
            <h4 class="mb-20 strong">Близько 240 млн років тому, задовго до появи людини,
                на Землі з'явилася нова група наземних хребетних
                тварин, що включала найкремезніших істот і найлютіших
                хижаків, які колись населяли нашу планету. Це були
                динозаври. Але, на жаль, живих динозаврів
                людині побачити не довелося, оскільки всі
                вони вимерли десь 65 млн років тому.
            </h4>
            <h3 class="mb-10">Той же плазун...</h3>
            <h5 class="mb-20">Динозаври належали до плазунів. Подібно до інших
                представників цього класу (крокодилів та ящірок) вони
                мали лускате тіло і відкладали яйця. На відміну від сучасних
                плазунів, у яких ноги розташовані по боках тулуба,
                а тіло торкається землі, ноги динозаврів знаходилися
                безпосередньо під тулубом (вони були міцніші й дозволяли
                легко переносити кремезні тіла і швидко бігати).
            </h5>
             <h3 class="mb-10">Розмаїття динозаврів</h3>
            <h5 class="mb-20">Серед динозаврів були і хижаки, і рослиноїдні. Хижі
                динозаври пересувалися на задніх ногах і мали гострі
                зуби. Рослиноїдні зазвичай мали довгі шиї, масивні
                тіла, довгі хвости й схожі на колони ноги; морда деяких
                нагадувала беззубий дзьоб. Динозаври були
                найрізноманітніші за розміром: деякі види не
                перевищували курча, інші були вдесятеро більші
                за слона. Голови та тіла багатьох динозаврів були
                оздоблені рогами, шипами, гребенями та кістяними
                пластинами.
            </h5>
        </div>
        <div v-else>
            <div class="background-with-image"></div>
            <div  class="blur-container">
                <h1 style="text-align:center">Ваш аккаунт заблоковано!!!</h1>
            </div>
        </div>
        
    </div>
</template>
<script>
export default {
  computed:{
        user(){
            return this.$store.getters.user;
        }
    }
}
</script>